{"config": [{"config": {"name": "lambda_1", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a1\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 64, 64, 3], "arguments": {}, "output_shape_type": "raw", "dtype": "float32"}, "class_name": "Lambda"}, {"config": {"name": "conv2d_1", "trainable": true, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 24, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "trainable": true, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 36, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "trainable": true, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 48, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_size": [5, 5], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "conv2d_4", "trainable": true, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "conv2d_5", "trainable": true, "strides": [2, 2], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "units": 80, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "units": 40, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "units": 16, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "units": 10, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_5", "units": 1, "trainable": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow"}