{"config": [{"config": {"function_type": "lambda", "name": "lambda_1", "output_shape": null, "arguments": {}, "dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a1\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3]}, "class_name": "Lambda"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 24, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 36, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 48, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "trainable": true, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 80, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 40, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 16, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_4", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 10, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_5", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}